---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralF
source: html/8856ce11-4192-d6b6-00f7-d06ffa12fefc.htm
---
# StructuralSectionGeneralF Properties

Common set of parameters for structural analysis.